In [1]:
%matplotlib inline

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [3]:
#stored data file path
mortality_data_path = "/Users/matthewvicario/Desktop/Project3/exp_mortality.csv"
exports_data_path = "/Users/matthewvicario/Desktop/Project3/all_exports.csv"

In [4]:
mortality_data = pd.read_csv(mortality_data_path)
mortality_data.head()

  Export Date  Species  Consignment Mortality Level Destination Mode
0      Aug-19  Buffalo                            6     Vietnam  Sea
1      Jul-19   Cattle                           22     Vietnam  Sea
2      May-19   Cattle                           53     Vietnam  Sea
3      May-19   Cattle                           25       China  Sea
4      Mar-19   Cattle                           53     Vietnam  Sea

In [5]:
mortality_count = pd.DataFrame(mortality_data.groupby(["Export Date","Species"],as_index = False)["Consignment Mortality Level"].sum())
mortality_count.head()

  Export Date Species  Consignment Mortality Level
0      Apr-16  Cattle                          155
1      Apr-17  Cattle                           95
2      Aug-15   Goats                           48
3      Aug-15   Sheep                          125
4      Aug-16   Sheep                          748

In [6]:
exports_data = pd.read_csv(exports_data_path)
exports_data.head()

  Mode Month State      Load Port Species    End Use   Country  Quantity  Year
0  Air   Jul    SA       Adelaide   Goats  Slaughter  Malaysia       100  2014
1  Sea   Jul    SA  Port Adelaide   Sheep  Slaughter   Bahrain     22000  2014
2  Sea   Jul    SA  Port Adelaide   Sheep  Slaughter     Qatar     25484  2014
3  Air   Jul    SA       Adelaide   Sheep  Slaughter  Malaysia       111  2014
4  Sea   Jul    WA      Fremantle  Cattle  Slaughter     Egypt      2403  2014

In [7]:
neworder = exports_data[["Month", "Year", "Species", "Quantity", "Mode","Country", "End Use"]]
neworder.rename(columns = {"Country":"Destination"}, inplace = True)
neworder = neworder.replace("August","Aug")
neworder = neworder.replace("July","Jul")
neworder = neworder.replace("Sept","Sep")
neworder.head()

/Users/matthewvicario/opt/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

  Month  Year Species  Quantity Mode Destination    End Use
0   Jul  2014   Goats       100  Air    Malaysia  Slaughter
1   Jul  2014   Sheep     22000  Sea     Bahrain  Slaughter
2   Jul  2014   Sheep     25484  Sea       Qatar  Slaughter
3   Jul  2014   Sheep       111  Air    Malaysia  Slaughter
4   Jul  2014  Cattle      2403  Sea       Egypt  Slaughter

In [8]:
start, stop = 2, 4
neworder["Year"] = neworder["Year"].astype(str)
neworder["Year"] = neworder["Year"].str.slice(start, stop)
neworder.head()

  Month Year Species  Quantity Mode Destination    End Use
0   Jul   14   Goats       100  Air    Malaysia  Slaughter
1   Jul   14   Sheep     22000  Sea     Bahrain  Slaughter
2   Jul   14   Sheep     25484  Sea       Qatar  Slaughter
3   Jul   14   Sheep       111  Air    Malaysia  Slaughter
4   Jul   14  Cattle      2403  Sea       Egypt  Slaughter

In [9]:
neworder["Export Date"] = pd.DataFrame(neworder["Month"].map(str) + "-" + neworder["Year"].map(str))
neworder.head()

  Month Year Species  Quantity Mode Destination    End Use Export Date
0   Jul   14   Goats       100  Air    Malaysia  Slaughter      Jul-14
1   Jul   14   Sheep     22000  Sea     Bahrain  Slaughter      Jul-14
2   Jul   14   Sheep     25484  Sea       Qatar  Slaughter      Jul-14
3   Jul   14   Sheep       111  Air    Malaysia  Slaughter      Jul-14
4   Jul   14  Cattle      2403  Sea       Egypt  Slaughter      Jul-14

In [10]:
clean_exports = neworder[["Export Date", "Species", "Quantity", "Mode","Destination", "End Use"]]
clean_exports.head(10)

  Export Date Species  Quantity Mode Destination    End Use
0      Jul-14   Goats       100  Air    Malaysia  Slaughter
1      Jul-14   Sheep     22000  Sea     Bahrain  Slaughter
2      Jul-14   Sheep     25484  Sea       Qatar  Slaughter
3      Jul-14   Sheep       111  Air    Malaysia  Slaughter
4      Jul-14  Cattle      2403  Sea       Egypt  Slaughter
5      Jul-14   Sheep     57770  Sea       Egypt  Slaughter
6      Jul-14  Cattle       400  Sea   Indonesia  Slaughter
7      Jul-14  Cattle     16626  Sea   Indonesia     Feeder
8      Jul-14  Cattle      2995  Sea       China    Breeder
9      Jul-14  Cattle       540  Sea       Japan     Feeder

In [11]:
export_count = pd.DataFrame(clean_exports.groupby(["Export Date","Species"],as_index = False)["Quantity"].sum())
export_count.head(10)

  Export Date  Species  Quantity
0      Apr-15  Buffalo       417
1      Apr-15   Cattle    168594
2      Apr-15     Deer        90
3      Apr-15    Goats      6832
4      Apr-15    Sheep    183948
5      Apr-16  Alpacas        23
6      Apr-16  Buffalo        77
7      Apr-16   Camels        22
8      Apr-16   Cattle    107892
9      Apr-16    Goats      6208

In [12]:
combined_count = pd.merge(mortality_count, export_count, how ='outer', left_on =["Export Date","Species"], right_on = ["Export Date", "Species"])
combined_count.head(10)

  Export Date  Species  Consignment Mortality Level  Quantity
0      Apr-16   Cattle                        155.0  107892.0
1      Apr-17   Cattle                         95.0   63013.0
2      Aug-15    Goats                         48.0   12014.0
3      Aug-15    Sheep                        125.0  159675.0
4      Aug-16    Sheep                        748.0  236033.0
5      Aug-17    Sheep                       2400.0  228535.0
6      Aug-18  Buffalo                          6.0    1204.0
7      Aug-19  Buffalo                          6.0    1588.0
8      Dec-17  Buffalo                         19.0     934.0
9      Dec-18  Buffalo                          3.0     510.0

In [13]:
combined_count["Export Date"].unique()

array(['Apr-16', 'Apr-17', 'Aug-15', 'Aug-16', 'Aug-17', 'Aug-18',
       'Aug-19', 'Dec-17', 'Dec-18', 'Feb-14', 'Feb-15', 'Jan-14',
       'Jan-15', 'Jan-18', 'Jul-16', 'Jul-18', 'Jul-19', 'Mar-16',
       'Mar-19', 'May-16', 'May-18', 'May-19', 'Nov-16', 'Oct-14',
       'Oct-18', 'Sep-17', 'Apr-15', 'Apr-18', 'Apr-19', 'Aug-14',
       'Dec-14', 'Dec-15', 'Dec-16', 'Dec-19', 'Feb-16', 'Feb-17',
       'Feb-18', 'Feb-19', 'Jan-16', 'Jan-17', 'Jan-19', 'Jul-14',
       'Jul-15', 'Jul-17', 'Jun-15', 'Jun-16', 'Jun-17', 'Jun-18',
       'Jun-19', 'Mar-15', 'Mar-17', 'Mar-18', 'May-15', 'May-17',
       'Nov-14', 'Nov-15', 'Nov-17', 'Nov-18', 'Nov-19', 'Oct-15',
       'Oct-16', 'Oct-17', 'Oct-19', 'Sep-14', 'Sep-15', 'Sep-16',
       'Sep-18', 'Sep-19'], dtype=object)

In [14]:
from datetime import datetime

In [21]:
#combined_count["Export Date"] = pd.to_datetime(combined_count["Export Date"],format ='%b-%y')
combined_count["Year"] = combined_count["Export Date"].map(lambda x: x.year)
combined_count.head(5)

    Export Date Species  Consignment Mortality Level  Quantity  Year
12   2014-01-01  Cattle                        214.0       0.0  2014
10   2014-02-01  Cattle                         49.0       0.0  2014
146  2014-07-01   Sheep                          0.0  276782.0  2014
145  2014-07-01   Goats                          0.0    5448.0  2014
144  2014-07-01  Cattle                          0.0   94012.0  2014

In [22]:
combined_count = combined_count.sort_values(by=["Export Date"])
combined_count.head()

    Export Date Species  Consignment Mortality Level  Quantity  Year
12   2014-01-01  Cattle                        214.0       0.0  2014
10   2014-02-01  Cattle                         49.0       0.0  2014
146  2014-07-01   Sheep                          0.0  276782.0  2014
145  2014-07-01   Goats                          0.0    5448.0  2014
144  2014-07-01  Cattle                          0.0   94012.0  2014

In [25]:
combined_count = combined_count.replace(np.nan,0)
new_count = combined_count[["Year","Species", "Consignment Mortality Level","Quantity"]]
new_count.head(15)

     Year  Species  Consignment Mortality Level  Quantity
12   2014   Cattle                        214.0       0.0
10   2014   Cattle                         49.0       0.0
146  2014    Sheep                          0.0  276782.0
145  2014    Goats                          0.0    5448.0
144  2014   Cattle                          0.0   94012.0
143  2014  Buffalo                          0.0     991.0
54   2014   Camels                          0.0      24.0
53   2014  Buffalo                          0.0     427.0
56   2014    Goats                          0.0    8583.0
55   2014   Cattle                          0.0   89334.0
57   2014    Sheep                          0.0  218317.0
288  2014    Goats                          0.0   15434.0
286  2014  Buffalo                          0.0     675.0
287  2014   Cattle                          0.0  136591.0
285  2014  Alpacas                          0.0     525.0

In [33]:
grouped_count = pd.DataFrame(new_count.groupby(["Species", "Year"],as_index = False).sum())
grouped_count.head(100)

    Species  Year  Consignment Mortality Level   Quantity
0   Alpacas  2014                          0.0      595.0
1   Alpacas  2015                          0.0     1113.0
2   Alpacas  2016                          0.0      243.0
3   Alpacas  2017                          0.0     1801.0
4   Alpacas  2018                          0.0      870.0
5   Alpacas  2019                          0.0      148.0
6   Buffalo  2014                          7.0     3144.0
7   Buffalo  2015                          0.0     5122.0
8   Buffalo  2016                          8.0     5792.0
9   Buffalo  2017                         25.0     9710.0
10  Buffalo  2018                          9.0     8882.0
11  Buffalo  2019                          6.0     9923.0
12   Camels  2014                          0.0       58.0
13   Camels  2015                          0.0      123.0
14   Camels  2016                          0.0       61.0
15   Camels  2017                          0.0       67.0
16   Camels  2018                          0.0        4.0
17   Cattle  2014                        327.0   656169.0
18   Cattle  2015                         38.0  1312670.0
19   Cattle  2016                        216.0  1142459.0
20   Cattle  2017                         95.0   867056.0
21   Cattle  2018                        121.0  1126379.0
22   Cattle  2019                        153.0  1298726.0
23     Deer  2015                          0.0       90.0
24     Deer  2016                          0.0       80.0
25    Goats  2014                          0.0    50311.0
26    Goats  2015                         48.0    87676.0
27    Goats  2016                          0.0    54201.0
28    Goats  2017                          0.0    12245.0
29    Goats  2018                          0.0    22644.0
30    Goats  2019                          0.0    16059.0
31    Sheep  2014                        174.0  1214624.0
32    Sheep  2015                        125.0  2071705.0
33    Sheep  2016                       2489.0  1838027.0
34    Sheep  2017                       2400.0  1887416.0
35    Sheep  2018                          0.0  1176051.0
36    Sheep  2019                          0.0  1118499.0

In [ ]:
#grouped_spec = new_count.loc[new_count["Species"] == "Cattle"]
#new_count.head()